/* $Id: jfs_ifs.c,v 1.2 2003/09/21 08:42:56 pasha Exp $ */

static char *SCCSID = "@(#)1.120.1.2  12/2/99 11:13:28 src/jfs/ifs/jfs_ifs.c, sysjfs, w45.fs32, fixbld";
/*
 *
 *
 *   Copyright (c) International Business Machines  Corp., 2000
 *
 *   This program is free software;  you can redistribute it and/or modify
 *   it under the terms of the GNU General Public License as published by
 *   the Free Software Foundation; either version 2 of the License, or
 *   (at your option) any later version.
 *
 *   This program is distributed in the hope that it will be useful,
 *   but WITHOUT ANY WARRANTY;  without even the implied warranty of
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See
 *   the GNU General Public License for more details.
 *
 *   You should have received a copy of the GNU General Public License
 *   along with this program;  if not, write to the Free Software
 *   Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
 *
 *   MODULE_NAME:       jfs_ifs.c
 *
 *   COMPONENT_NAME:    sysjfs
 *
 */

/*
 * Change History :
 * PS 2001-2003 apply IBM fixes
 *
 */

#define INCL_DOSERRORS
#define INCL_DOSPROCESS
#define INCL_NOPMAPI
#define INCL_LONGLONG

#define _cdecl __cdecl

#include <os2.h>
/* FIL_NAMEISVALID is not in bsedos.h */
#define FIL_NAMEISVALID 6
#define FIL_LVL7    7

#include <fsd.h>
#include <sysbloks.h>
#include <extboot.h>
#include <stdlib.h>

#include "jfs_os2.h"
#include "mmph.h"
#include "jfs_inode.h"
#include "jfs_dirent.h"
#include "jfs_cntl.h"
#include "jfs_lock.h"
#include "jfs_dmap.h"
#include "jfs_ea.h"
#include "jfs_superblock.h"
#include "jfs_proto.h"
#include "jfs_chkdsk.h"
#include "jfs_clrbblks.h"
#include "jfs_defragfs.h"
#include "jfs_extendfs.h"
#include "jfs_debug.h"
#include <priv/jfs_acl.h>
#include "jfs_dasdlim.h"                    // F226941
#include <uni_inln.h>

#define FIL_QUERYALLEAS 4   /* also defined in bsedosp.h */
//PS21092003 Begin
#define FILE_SWAP 0x100
extern struct dpbd * _Optlink _DosSelToFlat(struct dpbd *);
//PS End

#pragma pack(1)
struct CmdLock
{
    USHORT Cmd;           /* 0 for Lock */
    USHORT LockCnt;       /* number of locks that follow */
    ULONG TimeOut;        /* timeout in ms               */
};

struct fileio_lock
{
    USHORT Share;         /* 0 is exclusive 1 is shared */
    ULONG  Start;         /* byte offset of lock start  */
    ULONG  Length;        /* length of lock             */
};

struct CmdUnLock
{
    USHORT Cmd;           /* 1 for UnLock */
    USHORT LockCnt;       /* number of locks that follow */
};

struct fileio_unlock
{
    ULONG  Start;         /* byte offset of unlock start  */
    ULONG  Length;        /* length of unlock             */
};

struct CmdSeek
{
    USHORT Cmd;           /* 2 for seek                 */
    USHORT Method;        /* 0 for absolute             */
                          /* 1 for relative to current  */
                          /* 2 for relative to EOF      */
    LONG  Position;       /* position or delta          */
    LONG  Actual;         /* actual position seeked to  */
};

struct CmdIO
{
    USHORT Cmd;           /* 3 for read 4 for write     */
    void * _Seg16 Buffer; /* data buffer                */
    USHORT BufferLen;     /* buffer length              */
    USHORT Actual;        /* actual bytes transferred   */

};
#pragma pack()


struct jfs_sffsd
{
    struct vnode * vnode_ptr;
    struct file_lock * lock_anchor;
    uint32 reserved[4];
};

/*****
 *
 * Externs
 *
 */
unsigned long   nomounts = 0;   /* Init error occurred.  Do not mount anything*/
unsigned long   SyncOnClose = 0;/* set to 1 to cause synchronous write on close */
unsigned long   SyncRunning = 0;    /* Insures only one jfssync thread */
event_t     SyncEvent;  /* Event jfssync thread sleeps on */

extern struct ucred *pcred;     /* for calls to vfs/vnode ops */
extern struct vfs *vfs_anchor;     /* used to find log VPB      */

extern int32 LazyOff;
extern int32 SyncTime;
extern int32 maxSyncTime;
extern int32 minSyncTime;
extern uint32 CacheSize;
extern pool_t * lock_pool;         /* pool of lock structures        */
extern pool_t *cache_list_pool;
extern struct cCache cachemgr;                  // D230860
extern int32    TlocksLow;                      //PS21092003

extern XSPINLOCK_T  jfs_IOCacheLock;
/*****
 *
 * Prototypes for calls to top-level JFS routines.
 *
 */
int32   jfs_init2(void);
int     jfs_mount(struct vfs *, struct ucred *);
int     jfs_umount(struct vfs *, int, struct ucred *);
int     jfs_sync(struct vfs *);

int     jfs_cntl(struct vfs *, int, caddr_t, size_t, struct ucred *);
int     jfs_link(struct vnode *, struct vnode *, char *, struct ucred *);
int     jfs_mkdir(struct vnode *, UniChar *, int, EAOP *, struct ucred *);
int     jfs_remove(struct vnode *, struct vnode *, UniChar *, boolean_t,
                   struct ucred *);
int     jfs_rename(struct vnode *, struct vnode *, UniChar *,
                   struct vnode *, struct vnode *, UniChar *,
                   struct dasd_usage *, struct dasd_usage *, uint32); //F226941
int     jfs_rmdir(struct vnode *, struct vnode *, UniChar *, struct ucred *);
int     jfs_open(struct vnode *, int, int, EAOP *, struct ucred *);
int     jfs_create(struct vnode *, struct vnode **, int, int, UniChar *,
                   EAOP *, struct ucred *);
int     jfs_hold(struct vnode *);
int     jfs_rele(struct vnode *);
int     jfs_close(struct vnode *, int, caddr_t, struct ucred *);
int     jfs_read(struct vnode *, int64, caddr_t, int64 *, int32);
int     jfs_write(struct vnode *, int64, caddr_t, int64 *, int32);
int     jfs_access(struct vnode *, int, int, struct ucred *);
int     jfs_getattr(struct vnode *, struct vattr *, struct ucred *);
int     jfs_setattr(struct vnode *, int, int, int, int, struct ucred *);
int     jfs_fsync(struct vnode *, int, int, struct ucred *);
int     jfs_ftruncate(struct vnode *, int, offset_t, caddr_t, struct ucred *);
int     jfs_pageio(struct vnode *, struct PageCmdHeader *);
int32   jfs_SetLevel1Info (inode_t *, FILESTATUS *, int32);
int32   jfs_SetLevel11Info (inode_t *, FILESTATUS3L *, int32);
int32   jfs_GetLevel1Info (inode_t *, FILESTATUS *, int32);
int32   jfs_GetLevel11Info (inode_t *, FILESTATUS3L *, int32);
int32   jfs_SetLevel2Info (inode_t *, EAOP *, int32);
int32   jfs_GetLevel2Info (inode_t *, FILESTATUS2 *, int32);
int32   jfs_GetLevel12Info (inode_t *, FILESTATUS4L *, int32);
int32   jfs_GetLevel3Info (inode_t *ip, GEALIST *pgeal, FEALIST *pfeal,
                           ULONG *oError);
void    jfs_EABufFree (char *, int);

int     pathlookup(struct vfs *, pathlook_t *, struct ucred *);
int     pathlookup_pc(struct vfs *, UniChar *, UniChar *);
int     readdir(struct vnode *, struct fsfd *, char *, uint32, uint32 *, uint32,
                uint32, EAOP *, struct ucred *,struct dpdb *);   //PS21092003

int32   get_fileinfo(struct inode *, char **, uint32, UniChar *,
                     uint32, uint32, uint32, EAOP *, unsigned short);
void    get_vattr(struct inode *, struct vattr *);
void    Net_To_Dos_Date(uint32, uint16 *, uint16 *);
int32   dasd_read(int64, caddr_t, int64 *, struct vfs *);
int32   dasd_write(int64, caddr_t, int64 *, struct vfs *);
int32   rawRead(inode_t *, int64, cbuf_t **);
int32   rawWrite(inode_t *, cbuf_t *, uint32 flag);
int32   readSuper(inode_t *, cbuf_t **);
int32   jfs_readFAC(inode_t *, int64, int64 *, cache_list_t *);
int32   jfs_getacc0(inode_t *, struct jfs_access_parms *);
int32   jfs_getacc1(inode_t *, struct jfs_access_parms *, char *, int32 *);
int32   jfs_SetACL(inode_t *, void *, int32);
int32   jfs_enumACL(struct vnode *,struct jfs_access_parms *, char *, int32 *);
enum_instance_t *alloc_enum(void);
int32   verify_enum(enum_instance_t *);
int32   free_enum(enum_instance_t *);
void    enum_exit(int32 pid);
int32   hard_quiesce(struct vfs *);
int32   hard_resume(struct vfs *);
void    iwritelocklist(int, ...);               // F226941
#ifdef _JFS_LAZYCOMMIT
int32   jfs_lazycommit(void);                   // D230860
#endif
#ifdef _JFS_CACHESTATS
void    getCacheStats(struct cachestats *);         // D230860
#endif

int32 jfs_filelock( struct vnode *vnode_ptr,      /* object vnode          */
                    struct file_lock * * lock_anchor,   /* lock anchor           */
                    uint32 lock_count,                  /* lock count            */
                    struct lock_info * lock_list,       /* list of locks         */
                    uint32 timeout,                     /* timeout in ms         */
                    uint32 unlock_count,                /* unlock count          */
                    struct unlock_info * unlock_list,   /* list of unlocks       */
                    uint16 pid,                         /* owner pid             */
                    int32  longlock);           /* True if longlong locks */

void wake_pending_locks(uint32 start,
                        uint32 length,
                        struct file_lock * search_list);

int32 check_read_locks(struct gnode *, int64, int64, unsigned short,
                       struct file_lock **);

// BEGIN F226941

APIRET APIENTRY DASD_FSCTL (
                           union argdat    *pArgDat,
                           unsigned long   iArgType,
                           unsigned long   func,
                           char            *pParm,
                           unsigned long   lenParm,
                           unsigned short  *plenParmIO,
                           char            *pData,
                           unsigned long   lenData,
                           unsigned short  *plenDataIO);

APIRET APIENTRY DASD_FSCTL2 (
                            union argdat    *pArgDat,
                            unsigned long   iArgType,
                            unsigned long   func,
                            char            *pParm,
                            unsigned long   lenParm,
                            unsigned short  *plenParmIO,
                            char            *pData,
                            unsigned long   lenData,
                            unsigned short  *plenDataIO);

// END F226941

APIRET APIENTRY FS32_READ(
                         struct sffsi    *psffsi,
                         struct sffsd    *psffsd,
                         void            *pData,
                         unsigned long   *pLen,
                         unsigned long   IOflag);

APIRET APIENTRY FS32_WRITE(
                          struct sffsi    *psffsi,
                          struct sffsd    *psffsd,
                          void            *pData,
                          unsigned long   *pLen,
                          unsigned long   IOflag);

APIRET APIENTRY FS32_CHGFILEPTRL (
                                 struct sffsi    *psffsi,
                                 struct sffsd    *psffsd,
                                 long long       offset,
                                 unsigned long   type,
                                 unsigned long   IOflag);

struct  vfs *VPBtoVFS(SHANDLE hVPB);
struct  vfs *PATHtoVFS(char *);

#ifdef  _JFS_STATISTICS
int     jfsStatistics(char *, size_t);
int     ncStatistics(caddr_t, int32);
int     bmStatistics(caddr_t, int32);
int     lmStatistics(caddr_t, int32);
#endif  /* _JFS_STATISTICS */

int32   jfs_strtoUCS(UniChar *, char *, int32);
int32   jfs_strfromUCS(char *, UniChar *, int32, int32);

/*****
 *
 * Global Data
 *
 */

#define LONESTAR L"*"

extern pool_t   *unipool;

extern  struct InfoSegLDT * _Seg16 pLIS;


/* log volume info */
uint32 logVPB = 0;
struct vpfsi *logvpfs = 0;
void * _Seg16 logStrat2;
void (* APIENTRY logStrat3)();

/* page volume */
unsigned short page_hVPB = 0;

/* lock defines */
#define LOCK_EXPIRED   0x0L
#define LOCK_WAKEUP    0x1L
#define LOCK_CANCELED  0x2L

/* FILEIO DEFINES */
#define FILEIO_LOCK    0
#define FILEIO_UNLOCK  1
#define FILEIO_SEEK    2
#define FILEIO_READ    3
#define FILEIO_WRITE   4

#define SEEK_ABSOLUTE   0
#define SEEK_REL_CURR   1
#define SEEK_REL_EOF    2


/*
 * FS Operation Trace Data
 *
 * define _FS_OP_TRACE to turn on operation tracing
 */
#ifdef  _FS_OP_TRACE

/* Operation IDs
 */

#define FINDFIRST       0x10    /* directory operations */
#define FINDNEXT        0x11
#define FINDFROMNAME    0x12
#define FINDCLOSE       0x13

#define OPENCREATE      0x20    /* open file operations */
#define CLOSE           0x21
#define READ            0x22
#define WRITE           0x23
#define COMMIT          0x24
#define NEWSIZE         0x25
#define CHGFILEPTR      0x26
#define IOCTL           0x27
#define FILEINFO        0x28
#define FILEIO          0x2A
#define FILELOCKS       0x2B
#define CANCELLOCKREQ   0x2C
#define READFAC     0x2D

#define FILEATTRIBUTE   0x30    /* name based operations */
#define PATHINFO        0x31
#define CHDIR           0x32
#define COPY            0x33
#define MOVE            0x34
#define DELETE          0x35
#define MKDIR           0x36
#define RMDIR           0x37

#define MOUNT           0x40    /* volume based operations */
#define FSINFORM        0x41
#define FSCTL           0x42
#define FLUSHBUF        0x43
#define SHUTDOWN        0x44

#define OPENPAGEFILE    0x50    /* page space operations */
#define ALLOCATEPGSP    0x51
#define DOPAGEIO        0x52
#define SETSWAP         0x53

#define EXIT            0x60    /* others (not supported) */
#define ATTACH          0x61
#define NMPIPE          0x62
#define PROCESSNAME     0x63
#define FINDNOTIFYCLOSE 0x6A
#define FINDNOTIFYFIRST 0x6B
#define FINDNOTIFYNEXT  0x6C


/* Trace Structure
 *
 * The structure is ordered to make it easier to look at in the debugger --
 * byte swapping causes the op to be displayed in the first position.
 * The sequence number must be first so that the rest of the structure can
 * be compared easily using memcmp.
 */
struct fs_optrc
{
    uint16          fot_seq;        /* sequence number (must be first) */
    uint8           fot_subop;      /* sub-operation; flags or type */
    uint8           fot_op;         /* operation; see defines above */
    caddr_t         fot_other;      /* other operation dependent data */
    caddr_t         fot_nmnode;     /* file name or vnode pointer */
    uint32          fot_ptid;       /* process and thread id */
};

#define TRC_EVENTS      256

struct  fs_optrc trc_lst[TRC_EVENTS];
struct  fs_optrc *trc_cur = 0;
struct  fs_optrc *trc_prev = 0;
uint16  trc_sequence = 0;

void    fsoptrace(uint32, uint32, caddr_t, caddr_t);

SPINLOCK_T  optrace_lock;

#define FSoptrace(op, subop, other, nmnode) \
        fsoptrace((op), (uint32)(subop), (caddr_t)(other), (caddr_t)(nmnode))

#else  /* _FS_OP_TRACE */
#define FSoptrace(op, subop, other, nmnode)
#endif /* _FS_OP_TRACE */

#pragma pack(1)
/* Operation counts
 */
struct _opstats
{
    int allocatepagespace;  /* 00 */
    int attach;             /* 01 */
    int chdir;              /* 02 */
    int chgfileptr;         /* 03 */
    int close;              /* 04 */
    int commit;             /* 05 */
    int copy;               /* 06 */
    int delete;             /* 07 */
    int dopageio;           /* 08 */
    int exit;               /* 09 */
    int fileattribute;      /* 0a */
    int fileinfo;           /* 0b */
    int fileio;             /* 0c */
    int findclose;          /* 0d */
    int findfirst;          /* 0e */
    int findfromname;       /* 0f */
    int findnext;           /* 10 */
    int findnotifyclose;    /* 11 */
    int findnotifyfirst;    /* 12 */
    int findnotifynext;     /* 13 */
    int flushbuf;           /* 14 */
    int fsctl;              /* 15 */
    int fsinfo;             /* 16 */
    int ioctl;              /* 17 */
    int mkdir;              /* 18 */
    int mount;              /* 19 */
    int move;               /* 1a */
    int newsize;            /* 1b */
    int nmpipe;             /* 1c */
    int opencreate;         /* 1d */
    int openpagefile;       /* 1e */
    int pathinfo;           /* 1f */
    int processname;        /* 20 */
    int read;               /* 21 */
    int rmdir;              /* 22 */
    int setswap;            /* 23 */
    int shutdown;           /* 24 */
    int write;              /* 25 */
    int cancellockreq;      /* 26 */
    int filelocks;          /* 27 */
    int cacheread;          /* 28 */
    int returnfilecache;    /* 29 */
    int LastCalled;         /* PS */
} opstats;
#pragma pack()

/*
 * Message stuff - messages defined in misc.asm in 16-bit data segment
 */
#define LT16M_MSGNO 0
extern  uint8   LT16DriveLtr;   /* position within message for drive letter */
int32 FSH_CRITERROR(int32, int32, char *);  /* misc.asm */

/*****
 *
 * Declarations for the FSD entry points.
 *
 */

APIRET APIENTRY FS32_ALLOCATEPAGESPACE (
                                       struct sffsi    *psffsi,
                                       struct sffsd    *psffsd,
                                       unsigned long   size,
                                       unsigned long   contig)
{
    int rc;
    struct vnode *vp = *(struct vnode **)psffsd;

    FSoptrace(ALLOCATEPGSP, contig, size, vp);
    opstats.allocatepagespace++;
#ifdef FreeJFS
    opstats.LastCalled=0;             // PS
#endif

    /* The ftruncate operation will extend or reduce the size
