
/*
 *@@sourcefile exeh.h:
 *      header file for exeh.c. See remarks there.
 *
 *      Note: Version numbering in this file relates to XWorkplace version
 *            numbering.
 *
 *@@include #define INCL_WINPROGRAMLIST         // for some funcs only
 *@@include #include <os2.h>
 *@@include #include "helpers\dosh.h"
 *@@include #include "helpers\exeh.h"
 */

/*      This file Copyright (C) 2000-2002 Ulrich M”ller,
 *                                        Martin Lafaix.
 *      This file is part of the "XWorkplace helpers" source package.
 *      This is free software; you can redistribute it and/or modify
 *      it under the terms of the GNU General Public License as published
 *      by the Free Software Foundation, in version 2 as it comes in the
 *      "COPYING" file of the XWorkplace main distribution.
 *      This program is distributed in the hope that it will be useful,
 *      but WITHOUT ANY WARRANTY; without even the implied warranty of
 *      MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *      GNU General Public License for more details.
 */

#if __cplusplus
extern "C" {
#endif

#ifndef EXEH_HEADER_INCLUDED
    #define EXEH_HEADER_INCLUDED

    #pragma pack(1)

    /********************************************************************
     *
     *   DOS exe header
     *
     ********************************************************************/

    /*
     *@@ DOSEXEHEADER:
     *      old DOS EXE header at offset 0
     *      in any EXE file.
     *
     *@@changed V0.9.7 (2000-12-20) [umoeller]: fixed NE offset
     *@@changed V0.9.9 (2001-04-06) [lafaix]: additional fields defined
     */

    typedef struct _DOSEXEHEADER
    {
         USHORT usDosExeID;             // 00: DOS exeid (0x5a4d)
         USHORT usFileLenMod512;        // 02: filelen mod 512
         USHORT usFileLenDiv512;        // 04: filelen div 512
         USHORT usSegFix;               // 06: count of segment adds to fix
         USHORT usHdrPargCnt;           // 08: size of header in paragrphs
         USHORT usMinAddPargCnt;        // 0a: minimum addtl paragraphs count
         USHORT usMaxAddPargCnt;        // 0c: max addtl paragraphs count
         USHORT usSSStartup;            // 0e: SS at startup
         USHORT usSPStartup;            // 10: SP at startup
         USHORT usHdrChecksum;          // 12: header checksum
         USHORT usIPStartup;            // 14: IP at startup
         USHORT usCodeSegOfs;           // 16: code segment offset from EXE start
         USHORT usRelocTableOfs;        // 18: reloc table ofs.header (Win: >= 0x40 || 0)
         USHORT usOverlayNo;            // 1a: overlay no.
         USHORT usLinkerVersion;        // 1c: linker version (if 0x18 > 0x28)
         USHORT usUnused1;              // 1e: unused
         USHORT usBehaviorBits;         // 20: exe.h says this field contains
                                        //     'behavior bits'
         USHORT usUnused2;              // 22: unused
         USHORT usOEMIdentifier;        // 24: OEM identifier
         USHORT usOEMInformation;       // 26: OEM information
         ULONG  ulUnused3;              // 28:
         ULONG  ulUnused4;              // 2c:
         ULONG  ulUnused5;              // 30:
         ULONG  ulUnused6;              // 34:
         ULONG  ulUnused7;              // 38:
         ULONG  ulNewHeaderOfs;         // 3c: new header ofs (if 0x18 >= 0x40 || 0)
                    // fixed this from USHORT, thanks Martin Lafaix
                    // V0.9.7 (2000-12-20) [umoeller]
    } DOSEXEHEADER, *PDOSEXEHEADER;

    /********************************************************************
     *
     *   New Executable (NE)
     *
     ********************************************************************/

    // NE and LX OS types
    #define NEOS_UNKNOWN        0
    #define NEOS_OS2            1   // Win16 SDK says: "reserved"...
    #define NEOS_WIN16          2
    #define NEOS_DOS4           3   // Win16 SDK says: "reserved"...
    #define NEOS_WIN386         4   // Win16 SDK says: "reserved"...

    /*
     *@@ NEHEADER:
     *      linear executable (LX) header format,
     *      which comes after the DOS header in the
     *      EXE file (at DOSEXEHEADER.ulNewHeaderOfs).
     *
     *@@changed V0.9.9 (2001-04-06) [lafaix]: fixed typo in usMoveableEntries
     */

    typedef struct _NEHEADER
    {
        CHAR      achNE[2];             // 00: "NE" magic                       ne_magic
        BYTE      bLinkerVersion;       // 02: linker version                   ne_ver
        BYTE      bLinkerRevision;      // 03: linker revision                  ne_rev
        USHORT    usEntryTblOfs;        // 04: ofs from this to entrytable      ne_enttab
        USHORT    usEntryTblLen;        // 06: length of entrytable             ne_cbenttab
        ULONG     ulChecksum;           // 08: MS: reserved, OS/2: checksum     ne_crc
        USHORT    usFlags;              // 0c: flags                            ne_flags
                #ifndef NENOTP // do not conflict with toolkit exe defs
                    #define NENOTP          0x8000          // Not a process == library
                    #define NENOTMPSAFE     0x4000          // Process is not multi-processor safe
                                                            // (Win3.1 SDK: "reserved")
                    #define NEIERR          0x2000          // Errors in image
                    #define NEBOUND         0x0800          // Bound Family/API
                                                            // (Win3.1 SDK: "first segment contains code
                                                            // that loads the application")
                    #define NEAPPTYP        0x0700          // Application type mask
                                                            // (Win3.1 SDK: "reserved")
                    #define NENOTWINCOMPAT  0x0100          // Not compatible with P.M. Windowing
                                                            // (Win3.1 SDK: "reserved")
                    #define NEWINCOMPAT     0x0200          // Compatible with P.M. Windowing
                                                            // (Win3.1 SDK: "reserved")
                    #define NEWINAPI        0x0300          // Uses P.M. Windowing API
                                                            // (Win3.1 SDK: "reserved")
                    #define NEFLTP          0x0080          // Floating-point instructions
                    #define NEI386          0x0040          // 386 instructions
                    #define NEI286          0x0020          // 286 instructions
                    #define NEI086          0x0010          // 8086 instructions
                    #define NEPROT          0x0008          // Runs in protected mode only
                                                            // (Win3.1 SDK: "reserved")
                    #define NEPPLI          0x0004          // Per-Process Library Initialization
                                                            // (Win3.1 SDK: "reserved")
                    #define NEINST          0x0002          // Instance data
                    #define NESOLO          0x0001          // Solo data (single data)
                #endif
        USHORT    usAutoDataSegNo;      // 0e: auto-data seg no.                ne_autodata
                                        // (Win3.1 SDK: "0 if both NEINST and NESOLO are cleared")
        USHORT    usInitlHeapSize;      // 10: initl. heap size                 ne_heap
                                        // (Win3.1 SDK: "0 if no local allocation")
        USHORT    usInitlStackSize;     // 12: initl. stack size                ne_stack
                                        // (Win3.1 SDK: "0 if SS != DS")
        ULONG     ulCSIP;               // 14: CS:IP                            ne_csip
        ULONG     ulSSSP;               // 18: SS:SP                            ne_sssp
        USHORT    usSegTblEntries;      // 1c: segment tbl entry count          ne_cseg
        USHORT    usModuleTblEntries;   // 1e: module ref. table entry count    ne_cmod
        USHORT    usNonResdTblLen;      // 20: non-resd. name tbl length        ne_cbnrestab
        USHORT    usSegTblOfs;          // 22: segment tbl ofs                  ne_segtab
                                        // (from start of NEHEADER)
        USHORT    usResTblOfs;          // 24: resource tbl ofs                 ne_rsrctab
                                        // (from start of NEHEADER)
        USHORT    usResdNameTblOfs;     // 26: resd. name tbl ofs               ne_restab
                                        // (from start of NEHEADER)
        USHORT    usModRefTblOfs;       // 28: module ref. table ofs            ne_modtab
                                        // (from start of NEHEADER)
        USHORT    usImportTblOfs;       // 2a: import name tbl ofs              ne_imptab
                                        // (from start of NEHEADER)
        ULONG     ulNonResdTblOfs;      // 2c: non-resd. name tbl ofs           ne_nrestab
                                        // (from start of EXE!)
        USHORT    usMoveableEntries;    // 30: moveable entry points count      ne_cmovent
        USHORT    usLogicalSectShift;   // 32: logcl. sector shift              ne_align
                                        // (Win3.1 SDK: "typically 4, but default is 9")
        USHORT    usResSegmCount;       // 34: resource segm. count             ne_cres
        BYTE      bTargetOS;            // 36: target OS (NEOS_* flags)         ne_exetyp
        BYTE      bFlags2;              // 37: addtl. flags                     ne_flagsothers
                                        // Win3.1 SDK:
                                        //      bit 1 --> Win2.x, but runs in Win3.x protected mode
                                        //      bit 2 --> Win2.x that supports prop. fonts
                                        //      bit 3 --> exec contains fastload area
                                /*
                                #define NELONGNAMES     0x01
                                #define NEWINISPROT     0x02
                                #define NEWINGETPROPFON 0x04
                                #define NEWLOAPPL       0x80
                                */
        // the following are not listed in newexe.h, but are documented for Win3.x
        USHORT    usFastLoadOfs;        // 38: fast-load area ofs
        USHORT    usFastLoadLen;        // 3a: fast-load area length
        USHORT    usReserved;           // 3c: MS: 'reserved'
        USHORT    usReqWinVersion;      // 3e: Win-only: min. Win version
    } NEHEADER, *PNEHEADER;

    /*
     *@@ OS2NERESTBLENTRY:
     *      OS/2 NE resource table entry.
     *
     *@@added V0.9.16 (2001-12-08) [umoeller]
     */

    typedef struct _OS2NERESTBLENTRY
    {
        USHORT      usType;
        USHORT      usID;
    } OS2NERESTBLENTRY, *POS2NERESTBLENTRY;

    /*
     *@@ OS2NESEGMENT:
     *      OS/2 NE segment definition.
     *
     *@@added V0.9.16 (2001-12-08) [umoeller]
     */

    typedef struct _OS2NESEGMENT       // New .EXE segment table entry
    {
        USHORT      ns_sector;      // File sector of start of segment
        USHORT      ns_cbseg;       // Number of bytes in file
        USHORT      ns_flags;       // Attribute flags
        USHORT      ns_minalloc;    // Minimum allocation in bytes
    } OS2NESEGMENT, *POS2NESEGMENT;

    /********************************************************************
     *
     *   Linear Executable (LX)
     *
     ********************************************************************/

    /*
     *@@ LXHEADER:
     *      linear executable (LX) header format,
     *      which comes after the DOS header in the
     *      EXE file (at DOSEXEHEADER.ulNewHeaderOfs).
     *
     *@@changed V0.9.9 (2001-04-06) [lafaix]: fixed auto data object and ulinstanceDemdCnt
     */

    typedef struct _LXHEADER
    {
        CHAR      achLX[2];             // 00: e32_magic  "LX" or "LE" magic
            // this is "LX" for 32-bit OS/2 programs, but
            // "LE" for MS-DOS progs which use this format
            // (e.g. WINDOWS\SMARTDRV.EXE). IBM says the
            // LE format was never released and superceded
            // by LX... I am unsure what the differences are.
        BYTE      fByteBigEndian;       // 02: e32_border byte ordering (1 = big endian)
        BYTE      fWordBigEndian;       // 03: e32_worder word ordering (1 = big endian)
        ULONG     ulFormatLevel;        // 04: e32_level exe format level (0)
        USHORT    usCPU;                // 08: e32_cpu CPU type
        USHORT    usTargetOS;           // 0a: e32_os OS type (NEOS_* flags)
        ULONG     ulModuleVersion;      // 0c: e32_ver module version
        ULONG     ulFlags;              // 10: e32_mflags module flags
                #ifndef E32NOTP // do not conflict with toolkit exe defs
                    #define E32NOTP          0x00008000L    // Library Module - used as NENOTP
                    #define E32NOLOAD        0x00002000L    // Module not Loadable
                    #define E32PMAPI         0x00000300L    // Uses PM Windowing API
                    #define E32PMW           0x00000200L    // Compatible with PM Windowing
                    #define E32NOPMW         0x00000100L    // Incompatible with PM Windowing
                    #define E32NOEXTFIX      0x00000020L    // NO External Fixups in .EXE
                    #define E32NOINTFIX      0x00000010L    // NO Internal Fixups in .EXE
                    #define E32SYSDLL        0x00000008L    // System DLL, Internal Fixups discarded
                    #define E32LIBINIT       0x00000004L    // Per-Process Library Initialization
                    #define E32LIBTERM       0x40000000L    // Per-Process Library Termination

                    #define E32APPMASK       0x00000300L    // Application Type Mask

                    // hiword defs added V1.0.1 (2003-01-17) [umoeller]
                    #define E32PROTDLL       0x00010000L    // Protected memory library module *
                    #define E32DEVICE        0x00020000L    // Device driver                   *
                    #define E32MODEXE        0x00000000L    // .EXE module                     *
                    #define E32MODDLL        0x00008000L    // .DLL module                     *
                    #define E32MODPROTDLL    0x00018000L    // Protected memory library module *
                    #define E32MODPDEV       0x00020000L    // Physical device driver          *
                    #define E32MODVDEV       0x00028000L    // Virtual device driver           *
                    #define E32MODMASK       0x00038000L    // Module type mask                *
                    #define E32NOTMPSAFE     0x00080000L    // Process is multi-processor unsafe *
                #endif
        ULONG     ulPageCount;          // 14: e32_mpages no. of pages in module
        ULONG     ulEIPRelObj;          // 18: e32_startobj obj # for IP
                                        // object to which EIP is relative
        ULONG     ulEIPEntryAddr;       // 1c: e32_eip EIP entry addr
        ULONG     ulESPObj;             // 20: e32_stackobj ESP object
        ULONG     ulESP;                // 24: e32_esp ESP
        ULONG     ulPageSize;           // 28: e32_pagesize page size (4K)
        ULONG     ulPageLeftShift;      // 2c: e32_pageshift page left-shift
        ULONG     ulFixupTblLen;        // 30: e32_fixupsize fixup section total size
        ULONG     ulFixupTblChecksum;   // 34: e32_fixupsum fixup section checksum
        ULONG     ulLoaderLen;          // 38: e32_ldrsize size req. for loader section
        ULONG     ulLoaderChecksum;     // 3c: e32_ldrsum loader section checksum
        ULONG     ulObjTblOfs;          // 40: e32_objtab object table offset
        ULONG     ulObjCount;           // 44: e32_objcnt object count
        ULONG     ulObjPageTblOfs;      // 48: e32_objmap object page table ofs
        ULONG     ulObjIterPagesOfs;    // 4c: e32_itermap object iter pages ofs
        ULONG     ulResTblOfs;          // 50: e32_rsrctab resource table ofs
        ULONG     ulResTblCnt;          // 54: e32_rsrccnt resource entry count
        ULONG     ulResdNameTblOfs;     // 58: e32_restab resident name tbl ofs
        ULONG     ulEntryTblOfs;        // 5c: e32_enttab entry tbl ofs
        ULONG     ulModDirectivesOfs;   // 60: e32_dirtab module directives ofs
        ULONG     ulModDirectivesCnt;   // 64: e32_dircnt module directives count
        ULONG     ulFixupPagePageTblOfs;// 68: e32_fpagetab fixup page tbl ofs
        ULONG     ulFixupRecTblOfs;     // 6c: e32_frectab fixup record tbl ofs
        ULONG     ulImportModTblOfs;    // 70: e32_impmod import modl tbl ofs
        ULONG     ulImportModTblCnt;    // 74: e32_impmodcnt import modl tbl count
        ULONG     ulImportProcTblOfs;   // 78: e32_impproc import proc tbl ofs
        ULONG     ulPerPageCSOfs;       // 7c: e32_pagesum per page checksum ofs
        ULONG     ulDataPagesOfs;       // 80: e32_datapage data pages ofs
        ULONG     ulPreloadPagesCnt;    // 84: e32_preload preload pages count
        ULONG     ulNonResdNameTblOfs;  // 88: e32_nrestab non-resdnt name tbl ofs
        ULONG     ulNonResdNameTblLen;  // 8c: e32_cbnrestab non-resdnt name tbl length
        ULONG     ulNonResdNameTblCS;   // 90: e32_nressum non-res name tbl checksum
        ULONG     ulAutoDataSegObj;     // 94: e32_autodata auto dataseg object
        ULONG     ulDebugOfs;           // 98: e32_debuginfo debug info ofs
        ULONG     ulDebugLen;           // 9c: e32_debuglen debug info length
        ULONG     ulInstancePrelCnt;    // a0: e32_instpreload instance preload count
        ULONG     ulInstanceDemdCnt;    // a0: e32_instdemand instance demand count
        ULONG     ulHeapSize16;         // a8: e32_heapsize heap size (16-bit)
        ULONG     ulStackSize;          // ac: e32_stacksize stack size
        BYTE      e32_res3[20];
                                        // Pad structure to 196 bytes
    } LXHEADER, *PLXHEADER;

    // additional LX structures

    /*
     *@@ RESOURCETABLEENTRY:
     *     LX resource table entry.
     *
     *@@added V0.9.16 (2001-12-08) [umoeller]
     */

    typedef struct _RESOURCETABLEENTRY     // rsrc32
    {
        USHORT  type;   // Resource type
        USHORT  name;   // Resource name
        ULONG   cb;     // Resource size
        USHORT  obj;    // Object number
        ULONG   offset; // Offset within object
    } RESOURCETABLEENTRY;

    /*
     *@@ OBJECTTABLEENTRY:
     *     LX object table entry.
     *
     *@@added V0.9.16 (2001-12-08) [umoeller]
     */

    typedef struct _OBJECTTABLEENTRY       // o32_obj
    {
        ULONG   o32_size;     // Object virtual size
        ULONG   o32_base;     // Object base virtual address
        ULONG   o32_flags;    // Attribute flags
        ULONG   o32_pagemap;  // Object page map index
        ULONG   o32_mapsize;  // Number of entries in object page map
        ULONG   o32_reserved; // Reserved
    } OBJECTTABLEENTRY;

    /*
     *@@ OBJECTPAGETABLEENTRY:
     *     LX object _page_ table entry, sometimes
     *     referred to as map entry.
     *
     *@@added V0.9.16 (2001-12-08) [umoeller]
     */

    typedef struct _OBJECTPAGETABLEENTRY   // o32_map
    {
        ULONG   o32_pagedataoffset;     // file offset of page
        USHORT  o32_pagesize;           // # of real bytes of page data
        USHORT  o32_pageflags;          // Per-Page attributes
    } OBJECTPAGETABLEENTRY;

    /*
     *@@ LXITER:
     *      iteration Record format for 'EXEPACK'ed pages.
     *
     *@@added V0.9.16 (2001-12-08) [umoeller]
     */

    typedef struct _LXITER
    {
        USHORT          LX_nIter;            // number of iterations
        USHORT          LX_nBytes;           // number of bytes
        unsigned char   LX_Iterdata;         // iterated data byte(s)
    } LXITER, *PLXITER;

    // object/segment flags (in NE and LX)
    #define OBJWRITE         0x0002L    // Writeable Object
    #define OBJDISCARD       0x0010L    // Object is Discardable
    #define OBJSHARED        0x0020L    // Object is Shared
    #define OBJPRELOAD       0x0040L    // Object has preload pages

    // resource flags
    #define RNMOVE           0x0010     // Moveable resource
    #define RNPURE           0x0020     // Pure (read-only) resource
    #define RNPRELOAD        0x0040     // Preloaded resource
    #define RNDISCARD        0xF000     // Discard priority level for resource

    /********************************************************************
     *
     *   Portable Executable (PE)
     *
     ********************************************************************/

    /*
     *@@ IMAGE_FILE_HEADER:
     *      first part of PE header (standard header).
     *
     *@@added V0.9.16 (2002-01-09) [umoeller]
     */

    typedef struct _IMAGE_FILE_HEADER
    {
        USHORT      usMachine;          // CPU type
                        #define IMAGE_FILE_MACHINE_UNKNOWN          0
                        #define IMAGE_FILE_MACHINE_I860         0x14d
                        #define IMAGE_FILE_MACHINE_I386         0x14c
                        #define IMAGE_FILE_MACHINE_R3000        0x162
                        #define IMAGE_FILE_MACHINE_R4000        0x166
                        #define IMAGE_FILE_MACHINE_R10000       0x168
                        #define IMAGE_FILE_MACHINE_ALPHA        0x184
                        #define IMAGE_FILE_MACHINE_POWERPC      0x1F0
        USHORT      usNumberOfSections;
        ULONG       ulTimeDateStamp;
        ULONG       ulPointerToSymbolTable;
        ULONG       ulNumberOfSymbols;
        USHORT      usSizeOfOptionalHeader;
        USHORT      fsCharacteristics;
                        #define IMAGE_FILE_RELOCS_STRIPPED          1 // No relocation info
                        #define IMAGE_FILE_EXECUTABLE_IMAGE         2
                        #define IMAGE_FILE_LINE_NUMS_STRIPPED       4
                        #define IMAGE_FILE_LOCAL_SYMS_STRIPPED      8
                        #define IMAGE_FILE_16BIT_MACHINE         0x40
                        #define IMAGE_FILE_BYTES_REVERSED_LO     0x80
                        #define IMAGE_FILE_32BIT_MACHINE        0x100
                        #define IMAGE_FILE_DEBUG_STRIPPED       0x200
                        #define IMAGE_FILE_SYSTEM              0x1000
                        #define IMAGE_FILE_DLL                 0x2000
                        #define IMAGE_FILE_BYTES_REVERSED_HI   0x8000
    } IMAGE_FILE_HEADER, *PIMAGE_FILE_HEADER;

    typedef struct _IMAGE_DATA_DIRECTORY
    {
        ULONG   VirtualAddress;
        ULONG   Size;
    } IMAGE_DATA_DIRECTORY,*PIMAGE_DATA_DIRECTORY;

    #define IMAGE_NUMBEROF_DIRECTORY_ENTRIES    16

    /*
     *@@ IMAGE_OPTIONAL_HEADER:
     *      second part of PE header (optional header).
     *
     *@@added V0.9.16 (2002-01-09) [umoeller]
     */

    typedef struct _IMAGE_OPTIONAL_HEADER
    {
        // Standard fields
        USHORT  Magic;              // 00
                    #define IMAGE_NT_OPTIONAL_HDR_MAGIC        0x10b
                    #define IMAGE_ROM_OPTIONAL_HDR_MAGIC       0x107
        BYTE    MajorLinkerVersion;     // 02
        BYTE    MinorLinkerVersion;     // 03
        ULONG   SizeOfCode;         // 04
        ULONG   SizeOfInitializedData;      // 08
        ULONG   SizeOfUninitializedData;    // 0C
        ULONG   AddressOfEntryPoint;        // 10
        ULONG   BaseOfCode;         // 14
        ULONG   BaseOfData;         // 18

        // NT additional fields
        ULONG   ImageBase;          // 1C
        ULONG   SectionAlignment;       // 20
        ULONG   FileAlignment;          // 24
        USHORT  MajorOperatingSystemVersion;    // 28
        USHORT  MinorOperatingSystemVersion;    // 2A
        USHORT  MajorImageVersion;      // 2C
        USHORT  MinorImageVersion;      // 2E
        USHORT  MajorSubsystemVersion;      // 30
        USHORT  MinorSubsystemVersion;      // 32
        ULONG   Reserved1;          // 34
        ULONG   SizeOfImage;            // 38
        ULONG   SizeOfHeaders;          // 3C
        ULONG   CheckSum;           // 40
        USHORT  usSubsystem;          // 44
                    #define IMAGE_SUBSYSTEM_UNKNOWN                 0
                    #define IMAGE_SUBSYSTEM_NATIVE                  1
                    #define IMAGE_SUBSYSTEM_WINDOWS_GUI             2   // Windows GUI subsystem
                    #define IMAGE_SUBSYSTEM_WINDOWS_CUI             3   // Windows character subsystem
                    #define IMAGE_SUBSYSTEM_OS2_CUI                 5
                    #define IMAGE_SUBSYSTEM_POSIX_CUI               7
        USHORT  DllCharacteristics;     // 46
        ULONG   SizeOfStackReserve;     // 48
        ULONG   SizeOfStackCommit;      // 4C
        ULONG   SizeOfHeapReserve;      // 50
        ULONG   SizeOfHeapCommit;       // 54
        ULONG   LoaderFlags;            // 58
        ULONG   NumberOfRvaAndSizes;        // 5C
                            // 60:
        IMAGE_DATA_DIRECTORY DataDirectory[IMAGE_NUMBEROF_DIRECTORY_ENTRIES];
    } IMAGE_OPTIONAL_HEADER, *PIMAGE_OPTIONAL_HEADER;

    // indices into the DataDirectory array
    #define IMAGE_FILE_EXPORT_DIRECTORY             0
    #define IMAGE_FILE_IMPORT_DIRECTORY             1
    #define IMAGE_FILE_RESOURCE_DIRECTORY           2
    #define IMAGE_FILE_EXCEPTION_DIRECTORY          3
    #define IMAGE_FILE_SECURITY_DIRECTORY           4
    #define IMAGE_FILE_BASE_RELOCATION_TABLE        5
    #define IMAGE_FILE_DEBUG_DIRECTORY              6
    #define IMAGE_FILE_DESCRIPTION_STRING           7
    #define IMAGE_FILE_MACHINE_VALUE                8  // Mips
    #define IMAGE_FILE_THREAD_LOCAL_STORAGE         9
    #define IMAGE_FILE_CALLBACK_DIRECTORY          10

    // directory entries, indices into the DataDirectory array
    #define IMAGE_DIRECTORY_ENTRY_EXPORT            0
